In [1]:
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn 
import pandas as pd
import numpy as np

In [2]:
dataset=pd.read_csv("tmp_data_jadi.csv")
columns=dataset.columns

In [3]:
#deletting bad data:
del_list=[]
null_list=dataset.isnull()
for i in range(len(dataset['Area'])):
    if len(dataset['Area'][i])>3:
        dataset=dataset.drop(i)
        del_list+=[i]
    else:
        if(null_list["Address"][i]):
            del_list+=[i]
            dataset=dataset.drop(i)

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3450 entries, 0 to 3478
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Area        3450 non-null   object
 1   Room        3450 non-null   int64
 2   Parking     3450 non-null   bool
 3   Warehouse   3450 non-null   bool
 4   Elevator    3450 non-null   bool
 5   Address     3450 non-null   object
 6   Price       3450 non-null   float64
 7   Price(USD)  3450 non-null   float64
dtypes: bool(3), float64(2), int64(1), object(2)
memory usage: 300.9+ KB

In [5]:
dataset.isnull().sum()

Area          0
Room          0
Parking       0
Warehouse     0
Elevator      0
Address       0
Price         0
Price(USD)    0
dtype: int64

In [6]:
dataset

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33
...,...,...,...,...,...,...,...,...
3474,86,2,True,True,True,Southern Janatabad,3.500000e+09,116666.67
3475,83,2,True,True,True,Niavaran,6.800000e+09,226666.67
3476,75,2,False,False,False,Parand,3.650000e+08,12166.67
3477,105,2,True,True,True,Dorous,5.600000e+09,186666.67
3478,82,2,False,True,True,Parand,3.600000e+08,12000.00

# train test split    &   standard scaler   &   label encoder:

In [7]:
from sklearn.preprocessing import LabelEncoder 
le=LabelEncoder()
dataset["Address"]=le.fit_transform(dataset["Address"])
dataset

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,156,1.850000e+09,61666.67
1,60,1,True,True,True,156,1.850000e+09,61666.67
2,79,2,True,True,True,117,5.500000e+08,18333.33
3,95,2,True,True,True,152,9.025000e+08,30083.33
4,123,2,True,True,True,150,7.000000e+09,233333.33
...,...,...,...,...,...,...,...,...
3474,86,2,True,True,True,163,3.500000e+09,116666.67
3475,83,2,True,True,True,105,6.800000e+09,226666.67
3476,75,2,False,False,False,115,3.650000e+08,12166.67
3477,105,2,True,True,True,39,5.600000e+09,186666.67
3478,82,2,False,True,True,115,3.600000e+08,12000.00

In [8]:
from sklearn.model_selection import train_test_split
x=dataset.drop(["Price", "Price(USD)"], axis=1)
y=dataset["Price(USD)"]

In [9]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
sc.fit_transform(x)
x

     Area  Room  Parking  Warehouse  Elevator  Address
0      63     1     True       True      True      156
1      60     1     True       True      True      156
2      79     2     True       True      True      117
3      95     2     True       True      True      152
4     123     2     True       True      True      150
...   ...   ...      ...        ...       ...      ...
3474   86     2     True       True      True      163
3475   83     2     True       True      True      105
3476   75     2    False      False     False      115
3477  105     2     True       True      True       39
3478   82     2    False       True      True      115

[3450 rows x 6 columns]

In [10]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=22)

In [11]:
# enshuring our data is spliting perfectly:
print("length: ")
print("x: ", x.shape)
print("x_train: ", x_train.shape)
print("x_test: ", x_test.shape)

print("\ny: ", y.shape)
print("y_train: ", y.shape)
print("y_test: ", y_test.shape)

length:
x:  (3450, 6)
x_train:  (2760, 6)
x_test:  (690, 6)

y:  (3450,)
y_train:  (3450,)
y_test:  (690,)

# regression modelling:

In [16]:
from sklearn.preprocessing import PolynomialFeatures
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
lr=LinearRegression()

err=0
index=0
for i in range(10):
    pf=PolynomialFeatures(degree=i)
    x_train_tmp=pf.fit_transform(x_train)
    lr.fit(x_train_tmp, y_train)
    pred=lr.predict(pf.fit_transform(x_test))
    r2=r2_score(y_test, pred)
    print(i, r2)
    if(r2>err):
        err=r2
        index=i

#this shows the best model:
print("index: ", index, "\tr2: ", err)

0 -0.0002841058494247317
1 0.48404253463525426
2 0.5611608458923897
3 0.5670955398392589
4 0.6559883976443768
5 0.7351755220758376
6 0.3448095336135374
7 -33.98486427120765
8 -3130.8693619416854
9 -22564.426734706445
index:  5 	r2:  0.7351755220758376